lab7_php_ci/ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `slug` = 'artikel-pertama'
 LIMIT 1
---
    public function view($slug = null)
    {
        $model = new ArtikelModel();
        $artikel = $model->where(['slug' => $slug])->first();

SELECT *
FROM `artikel`
---
    public function admin_index()
    {
        $title = 'Admin Portal Berita';
        $model = new ArtikelModel();

        try {
            $artikel = $model->findAll();

SELECT *
FROM `artikel`
WHERE `id` = '1'
 LIMIT 1
---
    public function edit($id)
    {
        $artikel = new ArtikelModel();

        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            try {
                $artikel->update($id, [
                    'judul' => $this->request->getPost('judul'),
                    'isi'   => $this->request->getPost('isi'),
                    'slug'  => url_title($this->request->getPost('judul'), '-', true),
                ]);
            } catch (DatabaseException $e) {
                // Jika database belum terset, tetap tampilkan form tanpa crash.
            }

            return redirect()->to('/admin/artikel');
        }

        try {
            $data = $artikel->where('id', $id)->first();